tests/fixtures/webhooks/billing_statement.finalized.json

{
    "id": "evt_YKgzJ5rKNje5SxfkvAEqvfRb48vqosYu",
    "resource": "event",
    "type": "billing_statement.finalized",
    "data": {
        "id": "bstm_jbvrBvJSTsyCDsYTMpyM3o8hEGdeX4tC",
        "resource": "billing_statement",
        "amount": 75000,
        "currency": "PHP",
        "customer_id": "cus_vhFA73Qu3M6GQwhRwEVgAX9aFZUAxeYD",
        "description": "Updated description",
        "due_at": 1774357865,
        "finalized_at": 1773753094,
        "billing_statement_merchant_name": null,
        "billing_statement_number": "UAEONUMZ-0001",
        "billing_statement_url": "https://bill.payrexhq.com/b/test_bstm_jbvrBvJSTsyCDsYTMpyM3o8hEGdeX4tC_secret_S1MNRpTH2MMvLcoBNu6KTpevmogbrfrU2YLMxZ47uT6wpBrMTo",
        "line_items": [
            {
                "id": "bstm_li_vSHaVoXNzQpMqMumS5F93vFsSyggmxg6",
                "resource": "billing_statement_line_item",
                "description": "Updated Line Item",
                "billing_statement_id": "bstm_jbvrBvJSTsyCDsYTMpyM3o8hEGdeX4tC",
                "livemode": false,
                "quantity": 1,
                "unit_price": 75000,
                "created_at": 1773752597,
                "updated_at": 1773752928
            }
        ],
        "livemode": false,
        "merchant_id": "merc_XNNXbTz2n4UAigUwdPRdPqYUk61vvBDW",
        "statement_descriptor": null,
        "status": "open",
        "metadata": null,
        "customer": {
            "id": "cus_vhFA73Qu3M6GQwhRwEVgAX9aFZUAxeYD",
            "name": "Test Customer",
            "email": "test@example.com"
        },
        "payment_intent": {
            "id": "pi_iN1qyQ18iNHL9AyAuYayN1b1PJvdnH97",
            "resource": "payment_intent",
            "amount": null,
            "amount_received": null,
            "amount_capturable": null,
            "client_secret": "pi_iN1qyQ18iNHL9AyAuYayN1b1PJvdnH97_secret_Y6RqvRcsxvNJSH8NdHx6cqLrpGwyoQMd",
            "currency": null,
            "description": null,
            "last_payment_error": null,
            "latest_payment": null,
            "livemode": false,
            "metadata": null,
            "payment_methods": null,
            "payment_method_id": null,
            "payment_method_options": null,
            "statement_descriptor": null,
            "status": "awaiting_payment_method",
            "next_action": null,
            "return_url": null,
            "created_at": 1773753094,
            "updated_at": 1773753094
        },
        "payment_settings": {
            "payment_methods": [
                "card"
            ]
        },
        "created_at": 1773752596,
        "updated_at": 1773753094
    },
    "livemode": false,
    "pending_webhooks": 1,
    "previous_attributes": {
        "status": "draft"
    },
    "created_at": 1773753094,
    "updated_at": 1773753094
}
